#!/usr/bin/python3


# 链接类公式
LINK_FORMULAE = {
    ("固定资产", "5"): "!$G6",
    ("投资性资产", "6"): "!$G7",
    ("长期金融资产", "7"): "!$G8",
    ("长期股权投资", "8"): "!$G9",
    ("商誉", "9"): "!$G10",
    ("其他无形资产", "10"): "!$G11",
    ("递延所得税资产", "11"): "!$G12",
    ("其他长期资产", "12"): "!$G13",

    ("预付土地款", "15"): "!$G16",
    ("开发中资产", "16"): "!$G17",
    ("持作销售的完工资产", "17"): "!$G18",
    ("应收及其他应收款", "18"): "!$G19",
    ("预付税金", "19"): "!$G20",
    ("应收内部往来", "20"): "!$G21",
    ("应收关联方", "21"): "!$G22",
    ("短期金融资产", "22"): "!$G23",
    ("受限资金", "23"): "!$G724",
    ("现金及现金等价物", "24"): "!$G25",

    ("股本", "28"): "!$G29",
    ("储蓄", "29"): "!$G30",
    ("留存收益", "30"): "!$G31",

    ("少数股东权益", "32"): "!$G33",

    ("长期借款", "35"): "!$G36",
    ("递延所得税负债", "36"): "!$G37",

    ("其他负债债", "39"): "!$G40",
    ("应付及其他应付款", "40"): "!$G41",
    ("预收账款", "41"): "!$G42",
    ("应交税金（核算企业所得税及土地增值税）", "42"): "!$G43",
    ("应付内部往来", "43"): "!$G44",
    ("应付关联方", "44"): "!$G45",
    ("短期借款", "45"): "!$G46",

    ("销售收入", "53"): "!$G54",
    ("减：销售税金及附加", "54"): "!$G55",
    ("销售成本", "55"): "!$G56",

    ("加：投资性物业公允值变化", "58"): "!$G59",
    ("减值准备", "59"): "!$G60",
    ("其他收入", "60"): "!$G61",
    ("减：销售费用", "61"): "!$G62",
    ("管理费用", "62"): "!$G63",
    ("其他费用", "63"): "!$G64",

    ("减：财务费用（仅核算利息支出）", "66"): "!$G67",

    ("减：土地增值税", "69"): "!$G70",
    ("减：企业所得税", "70"): "!$G71",

    ("其中：母公司净利", "73"): "!$G74",
    ("少数股东收益", "74"): "!$G75",

    ("加：期初未分配利润", "76"): "!$G77",
    ("加：新收入准则期初影响", "77"): "!$G78",
    ("减：提取法定盈余公积", "78"): "!$G79",
    ("减：分配利润", "79"): "!$G80",

}

# SUM 类公式，格式为 {(科目, 行): 公式}，行是为了保证 key 的唯一性，公式中省去了列数
SUM_FORMULAE = {
    ("非流动资产合计", "13"): "5:12",
    ("流动资产合计", "25"): "15:24",
    ("母公司所有者权益", "31"): "28:30",
    ("非流动负债合计", "37"): "35:36",
    ("流动负债合计", "46"): "39:45",
    ("毛利", "56"): "53:55",
    ("经营利润", "64"): "56:63",
    ("税前利润", "67"): "64:66",
    ("净利润", "71"): "67:70",
    ("期末未分配利润", "80"): "73,76:79",
}

# 加减乘除类公式，格式为 {(科目, 行): 公式}，行是为了保证 key 的唯一性，公式中省去了列数
PLUS_FORMULAE = {
    ("资产合计", "26"): "13+25",
    ("权益合计", "33"): "31+32",
    ("负债合计", "47"): "37+46",
    ("权益及负债合计", "48"): "33+47",
    ("检查", "49"): "26+48",
    ("其中：母公司净利", "73"): "71-74",
    ("检查", "81"): "80-30",
    ("check RE", "84"): "83-76"
}
