#!/usr/bin/python3

import numpy

"""
功能：一些公用的常量
"""


"""
*************************** merge_sheet 常量
"""

# 要合并的 sheet，格式为 {sheet, 表头所在行}，合并单元格中的表头，用上面的一行，无表头设为 None
ALL_SHEETS = {
    "表1-资产负债表": 4,
    "表2-利润表": 4,
    "表3-现金流量表": 4,
}

# 要过滤的数据，如下会筛选出表 "1.2-应收账款账龄" 列中 "借方余额" 为 0 和空的行，"城市" 列中为 "合计"和 的行，
# 若 FILTER_SWITCH = -1 则删除这些数据，保留其它数据，若 FILTER_SWITCH = 1 则保留这些数据，删除其它数据。
FILTER_VALUE = {
    "表1-资产负债表": {
        "期末余额": [0, numpy.NaN],
    },
    "表2-利润表": {
        "本年累计数": [0, numpy.NaN],
    },
    "表3-现金流量表": {
        "本年累计金额": [0, numpy.NaN],
    },
}

"""
*************************** change_cell_link 常量
"""
# 链接类公式，{(科目, 所在行数)" "连接到哪个单元格"}
LINK_FORMULAE = {
    ("固定资产", "5"): "!$G6",
    ("长期金融资产", "7"): "!$G8",
    ("长期股权投资", "8"): "!$G9",
    ("其他无形资产", "10"): "!$G11",
}

# SUM 类公式，格式为 {(科目, 所在行): 去掉列的公式}，行是为了保证 key 的唯一性，列会在遍历过程中取得
SUM_FORMULAE = {
    ("非流动资产合计", "13"): "5:12",
    ("流动资产合计", "25"): "15:24",
    ("母公司所有者权益", "31"): "28:30",
}

# 加减乘除类公式，格式为 {(科目, 所在行): 去掉列的公式}，行是为了保证 key 的唯一性，列会在遍历过程中取得
PLUS_FORMULAE = {
    ("资产合计", "26"): "13+25",
    ("权益合计", "33"): "31+32",
    ("负债合计", "47"): "37+46",
}

"""
*************************** check_sheet_name 常量
"""
# 所有 excel 都应该包含如下 Sheet
STANDARD_SHEET = [
    '表1-资产负债表',
    '表2-利润表',
    '表3-现金流量表',
]

"""
*************************** 
"""
